@php
    /* @var $post \App\Models\Post */
use App\Actions\GenerateImageMicro;
use App\Actions\Like;
@endphp
<div class="col-3">
    <div class="post-item position-relative ">
        <script type="application/ld+json">
            {!!(new GenerateImageMicro)->generate($post, $cityInfo['city'])!!}
        </script>
        <a href="/post/{{$post->url}}" class="d-block image-wrap">
            @if(isset($post->photo))
                <picture>

                    <source srcset="/360-500/thumbs{{str_replace('.jpg', '.webp', $post->photo)}}" type="image/webp">
                    <source srcset="/360-500/thumbs{{$post->photo }}" type="image/jpeg">

                    <img
                        @if(!isset($posts) or $posts->first() != $post)
                            loading="lazy"
                        @endif
                        title="Проститутка {{ $post->name }}"
                        srcset="/360-500/thumbs{{$post->photo}}" alt="{{ $post->name }}">
                </picture>
            @endif
            @if($post->tarif_id)
                <div class="tarif tarif_{{ $post->tarif_id }}">
                </div>
            @endif
        </a>
        <div class="info">
            <div class="name-age-wrap-video d-flex">
                <div class="age-name">
                    <a href="/post/{{$post->url}}">{{ $post->name }}</a>, {{ $post->age }}
                </div>
                <div class="check-video d-flex">
                    <div class="check-video-item">
                        @if($post->video)
                            <svg width="19" height="17" viewBox="0 0 19 17" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M19 14.669V3.24046C19 1.98331 17.9941 0.954742 16.7647 0.954742H2.23529C1.00588 0.954742 0 1.98331 0 3.24046V14.669C0 15.9262 1.00588 16.9547 2.23529 16.9547H16.7647C17.9941 16.9547 19 15.9262 19 14.669ZM6.70588 13.5262V4.38331L13.4118 8.95474L6.70588 13.5262Z"
                                    fill="#FF005C"/>
                            </svg>
                        @endif
                    </div>
                    <div class="check-video-item">
                        @if($post->check_photo_status)
                            <svg width="19" height="18" viewBox="0 0 19 18" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M17.269 6.40149C17.0549 6.10289 16.9064 5.76601 16.8325 5.4111C16.6532 4.46702 16.1763 3.59768 15.4656 2.91914C14.7548 2.24075 13.8441 1.78557 12.855 1.61436C12.4854 1.54514 12.1348 1.40328 11.8256 1.19773C11.0068 0.678716 10.0457 0.401825 9.06277 0.401825C8.07978 0.401825 7.11874 0.678709 6.29983 1.19773C5.98701 1.4021 5.63409 1.54382 5.26228 1.61436C4.27325 1.78557 3.3625 2.24078 2.65166 2.91914C1.94096 3.59768 1.46411 4.46699 1.28475 5.4111C1.21223 5.76392 1.06361 6.09856 0.848276 6.39374C0.295582 7.17203 0 8.09069 0 9.03096C0 9.97122 0.295582 10.8899 0.848276 11.6683C1.06238 11.9669 1.21084 12.3038 1.28475 12.6587C1.46411 13.6028 1.94099 14.4721 2.65166 15.1507C3.3625 15.8291 4.27322 16.2842 5.26228 16.4554C5.6319 16.5247 5.98247 16.6665 6.29171 16.8721C7.10706 17.3996 8.06948 17.6818 9.05451 17.6818C10.0396 17.6818 11.002 17.3996 11.8175 16.8721C12.1303 16.6677 12.4832 16.526 12.855 16.4554C13.844 16.2842 14.7548 15.829 15.4656 15.1507C16.1763 14.4721 16.6532 13.6028 16.8325 12.6587C16.9051 12.3059 17.0537 11.9712 17.269 11.6761C17.8217 10.8978 18.1173 9.9791 18.1173 9.03884C18.1173 8.09858 17.8217 7.17988 17.269 6.40149ZM12.935 7.2324L9.15859 10.8375C8.69509 11.2791 8.06683 11.5272 7.41185 11.5272C6.75699 11.5272 6.12876 11.2791 5.66511 10.8375L5.18258 10.3769L5.18272 10.3767C5.02376 10.2303 4.93319 10.0291 4.93126 9.81824C4.92933 9.60742 5.01632 9.40464 5.17238 9.25553C5.32858 9.10643 5.54102 9.02353 5.76189 9.02537C5.98275 9.02721 6.19366 9.11367 6.34712 9.26527L6.82965 9.72587C6.9842 9.873 7.1936 9.95564 7.41185 9.95564C7.63023 9.95564 7.8395 9.873 7.99405 9.72587L11.7708 6.12113C11.9799 5.92821 12.2802 5.85504 12.5606 5.92847C12.8412 6.00177 13.0602 6.21101 13.1372 6.47868C13.214 6.74635 13.1373 7.03297 12.9352 7.23261L12.935 7.2324Z"
                                    fill="#32ACFB"/>
                            </svg>
                        @endif
                    </div>

                </div>
            </div>
            <div class="metro-phone">
                <div class="phone"
                     data-city="{{ $post->city_id }}"
                     data-id="{{ $post->id }}"
                     onclick="show_phone(this)">
                    <svg width="19" height="20" viewBox="0 0 19 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_300_1129)">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M13.8277 10.6784C14.7593 11.1961 15.6915 11.714 16.6231 12.2317C17.0241 12.4544 17.2 12.9268 17.0422 13.3577C16.2406 15.5475 13.8931 16.7033 11.6842 15.8972C7.16109 14.2462 3.8084 10.8934 2.1573 6.37028C1.35108 4.16142 2.50698 1.81381 4.69676 1.01228C5.12765 0.854409 5.6001 1.03031 5.8233 1.43131C6.3405 2.36297 6.85834 3.29516 7.37606 4.22676C7.61875 4.66381 7.56171 5.18259 7.22953 5.55581C6.79451 6.04533 6.35957 6.53474 5.92456 7.02375C6.85314 9.28499 8.7694 11.2013 11.0307 12.1299C11.5197 11.6948 12.0091 11.2599 12.4986 10.8249C12.8724 10.4927 13.3907 10.4357 13.8277 10.6784L13.8277 10.6784Z"
                                  fill="white"/>
                        </g>
                        <defs>
                            <clipPath id="clip0_300_1129">
                                <rect width="19" height="19" fill="white" transform="translate(0 0.954742)"/>
                            </clipPath>
                        </defs>
                    </svg>
                    Показать телефон
                </div>
                @if($metro = $post->metro->first())
                    <div class="metro">
                        <a href="/{{ $metro->metro->filterUrl->filter_url }}"
                           class="metro-link">
                            <svg width="19" height="20" viewBox="0 0 19 20" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M11.9017 5.33234L9.54563 10.1963L7.22003 5.33234L5.2896 11.1995H4.9552V11.8531H6.91605V11.2299H6.61208L7.5696 8.60029L9.3024 11.8531H9.77357L11.5065 8.56989L12.4793 11.1996H12.1296V11.8531H14.1361V11.1996H13.7865L11.9017 5.33234Z"
                                    fill="white"/>
                                <path
                                    d="M9.50002 2.77872C7.66077 2.77872 5.92802 3.50829 4.63602 4.81549C3.35925 6.12269 2.66 7.84029 2.67517 9.64909C2.67517 11.2298 3.23754 12.7803 4.25591 14.0115C4.31667 14.0875 4.39269 14.1179 4.48387 14.1179H6.49033C8.0255 14.1179 10.0015 14.1331 11.6431 14.1331C12.9808 14.1331 14.1055 14.1331 14.6071 14.1179C14.6983 14.1179 14.7743 14.0724 14.8351 13.9963C15.8383 12.7499 16.3703 11.2299 16.3703 9.63393C16.3705 5.86433 13.2849 2.77873 9.50013 2.77873L9.50002 2.77872ZM14.44 13.5099C13.1328 13.5403 8.98322 13.5251 6.47522 13.5099H4.62082C3.75437 12.4155 3.26802 11.0475 3.26802 9.64912C3.26802 7.99234 3.9065 6.42672 5.07685 5.24112C6.26245 4.05541 7.82805 3.38672 9.50005 3.38672C12.9505 3.38672 15.7625 6.19872 15.7625 9.64912C15.7625 11.0627 15.3065 12.4003 14.4401 13.5099H14.44Z"
                                    fill="white"/>
                            </svg>
                            {{ $metro->metro->value }} </a>
                    </div>
                @endif
            </div>
            <div class="price">
                <div class="left-price">час <div class="price-text">{{ $post->price }}</div> </div>
                <div class="center"></div>
                <div class="right-price">два <div class="price-text">{{ $post->price * 2 }}</div></div>
            </div>
            <div class="body-params">
                <div class="body-param">
                    <img src="/images/breast.svg" alt="">
                    {{ $post->breast_size }}
                </div>
                <div class="body-param"><img src="/images/ves.svg" alt="">{{ $post->ves }}</div>
                <div class="body-param"><img src="/images/rost.svg" alt="">{{ $post->rost }}</div>
            </div>
        </div>

    </div>
</div>
